#ifndef ANGLERANGPAR_H
#define ANGLERANGPAR_H
//长度参数  单位：米
//**************幅度参数*******************
struct LENGTH_PARAM
{
 unsigned char ARM_REGULAR;   //吊臂是否规则 1－规则  0－不规则
 float ARM_FIX;               //主臂铰点到回转中心的距离
 float ARM_MOVE;              //主臂长度
 float ARM_FFIX;              //副钩长于主钩的长度
 unsigned char ARMNR_POT;     //角度长度对应点数
 float ARMNR_ANGLE[20];      // 不规则时的角度
 float ARMNR_RANGE[20];      //相应角度对应的幅度
}
LENGTH_PARAM[1]={
 {
  0,                 //吊臂是否规则 1－规则  0－不规
  10.0,              //主臂铰点到回转中心的距离
  40.0,              //主臂长度
  10.0,              //副臂长于主臂的长度
  9,                 //角度幅度对应点数
  {35.0,39.1,44.0,52.8,55.6,60.5,64.4,69.8,75.0},  // 不规则时的角度   单位：度
  {34.0,32.0,29.0,24.0,22.0,18.0,15.0,9.50,7.80},  //相应角度对应的幅度  单位：米

 }

};
//*********额重参数********************
struct EZHONG_PARAM
{
 float EZHONG_FG;           //副钩额重

 unsigned char EZHONG_POT;  //主钩额重幅度对应点数
 float FUDU[20];            //主钩幅度
 float EZHONG[20];          //主钩额重

 unsigned char EZHONG_ZD_POT;  //抓斗额重幅度对应点数
 float FUDU_ZD[20];            //抓斗对应幅度
 float EZHONG_ZD[20];          //抓斗额重
}
EZHONG_PARAM[1]={
{
  20,                 //副钩额重   单位：吨
  7,                  //主钩额重幅度对应点数
  {7.00,10.0,24.0,24.1,28.0,35.0,40.0}, //主钩幅度   单位：米
  {25.0,25.0,25.0,16.0,16.0,16.0,16.0}, //主钩额重   单位：吨
  6,                  //抓斗额重幅度对应点数
  {7.00,10.0,25.0,28.0,35.0,40.0},      //抓斗对应幅度
  {16.0,16.0,16.0,16.0,16.0,16.0},      //抓斗额重
}

};

//*********************门座机变幅取力的系数**************88
struct BAINFU_COEFF
{
 unsigned char POT;   //点数
 float ANGLE[20];     //幅度      单位：米
 float ZERO[20];      //零点      MA
 float COEFF[20];     //系数      单位：吨/MA
}
BIANFU_COEFF[8]={
//吊钩工况参数
 {
  3,                  //传感器1
  {0,40,90},
  {0.00,0.00,0.00},
  {0.96,0.96,0.96},
 },

 {
  3,                  //传感器2
  {0,40,90},
  {0.00,0.00,0.00},
  {1.02,1.02,1.02},
 },

//抓斗工况参数
 {
  3,                  //传感器1
  {0,40,90},
  {0.20,0.20,0.20},
  {0.96,0.96,0.96},
 },

 {
  3,                  //传感器2
  {0,40,90},
  {0.20,0.20,0.20},
  {1.02,1.02,1.02},
 }

};



struct XIUZHENG_PIANCHA
{
 unsigned char POT;        //点数
 float piancha_in[20];
 float piancha_out[20];
}
XIUZHENG_PIANCHA[5]={

//采集数据个数及速度修正
{
 10,    //点数
 {0.00,10.0,20.0,40.0,60.0,80.0,100,140,180,300},
 {1.00,1.00,1.00,1.00,1.00,1.00,1.0,1.0,1.0,1.0},
},

//两个传感器和线性修正
{
 14,    //点数
 {0.00,9.58,9.70,11.0,11.5,18.0,20.0,22.0,24.0,26.0,28.0,30.0,36.0,40.0},
 {1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00},
},


//幅度修正
{
 10,    //点数
 {00.0,9.60,10.0,13.0,15.0,20.0,25.0,30.0,34.0,50.0},
 {1.00,1.00,1.00,1.00,1.00,1.00,1.04,1.05,1.07,1.07},
},

//高度修正
{
 10,    //点数
 {50.0,38.0,35.0,32.0,25.0,22.0,13.0,10.0,9.60,0.00},
 {1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00},
},
//电量采集数据个数修正重量
{
 11,    //点数
 {5.00,10.0,14.0,18.0,22.0,30.0,40.0,50.0,80.0,120,300},
 {1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.0,1.0},
}


};





#endif // ANGLERANGPAR_H
